comp-sci/sml/free-monad.org
#+TITLE: Free Monads - SML
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2025-02-22T15:26:57-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Saturday February 22, 2025 at  3:26PM

* Overview
:PROPERTIES:
:CUSTOM_ID: h-d40ee261-e0d6-4991-9643-dd465129632e
:END:

The basic idea underlying free monads is to start with an endofunctor
$f$ and then turn it into a monad, just as the free group starts with
a set then turns it into a group.

Free monads are useful when it comes into describing side-effects
monadically. 

Haskell takes this idea and runs with it.

We will see how this works in Standard ML.

* Functors in SML
:PROPERTIES:
:CUSTOM_ID: h-77ec8efc-07fa-4faa-b0d3-52077da95d9a
:END:

A ~Functor~ (not to be confused with the builtin ~functor~ keyword in
the module language) is a structure adhering to the following
signature:

#+begin_src sml
signature FUNCTOR = sig
  type 'a t;
  val map : ('a -> 'b) -> 'a t -> 'b t;
end;
#+end_src

That's all we need. There are two functor laws, which are inspired by
category theory. If ~F~ is a functor, then...

- unit law: ~F.map id == id~
- preserves composition: ~F.map (g o f) = (F.map g) o (F.map f)~

Ta-duh!

(See also the [[file:functor.org][dedicated discussion]] about functors on its own page.)

* Derivation Using the Free Monoid
:PROPERTIES:
:CUSTOM_ID: h-f82f46d4-0bb4-4502-bc6e-f429a310b41a
:END:

A monad is a monoid in the category of endofunctors, and a free monad
is just the free monoid in that category. We can leverage this
information to deduce the structure of the ~join~ function for a free
monad. 

The free monoid is precisely the list. (When the free monoid is
generated by a singleton, it's isomorphic to the natural numbers.) The
analogy with free monads should be:

#+begin_example
datatype 'a list =          nil | cons of 'a * 'a list;
(* structure F : FUNCTOR *)
datatype 'a Free = Return of 'a | Join of ('a Free) F.t;
#+end_example

The intuition is that we have ~Join~ apply ~F~ iteratively. Zero
iterates would be the ~Return~ data constructor.

Free monoids have an ~append~ function (which, for lists, is...the
append function). The analogous function for monads would be the
~join : 'a F.t F.t -> 'a F.t~. Similarly, monoids have an =empty= constant,
which corresponds to the ~return~ function for monads in "programmer argot".

The free monoid of iterates of ~F~ would then correspond to a type of
the form
#+begin_example
datatype 'a Free = Zero of 'a | Succ of 'a Free F.t;
#+end_example
The empty "constant" would be ~empty : 'a -> 'a Free~ and it's given
precisely by the ~Zero~ constructor.

The append operation would have its type signature be
~append : 'a Free Free -> 'a Free~. This would send ~append (Zero x) = x~
since ~x : 'a Free~, and then the only question is how it would behave
on ~Succ x~?

Well, if we considered ~Succ x : 'a Free Free~, then ~x : 'a Free Free F.t~.
We see that ~F.map append : 'a Free Free F.t -> 'a Free F.t~, and so
it's obvious applicable to ~x~. However the resulting type is not ~'a Free~.
But it is the correct type to be fed into the ~Succ~ data constructor.
This amounts to "flattening" the "leafs" of ~x~. This suggests ~append (Succ x) = Succ (F.map append x)~
is the correct definition.

This ~append~ function is the ~join~ function for the free monad:
#+begin_example
fun append (Zero x) = x
  | append (Succ x) = Succ (F.map append x);

val join = append;
#+end_example

From the ~join~ function (and the functor gives us a ~map~ function),
we can infer the ~bind~ function immediately. 

* Free Monads
:PROPERTIES:
:CUSTOM_ID: h-39916d46-ea6d-4955-bda1-2e7a30a9742c
:END:

** Monad signature
:PROPERTIES:
:CUSTOM_ID: h-0744c31b-75ad-4322-a576-13930453262f
:END:

Just to review, we have the following signature for monads in Standard ML:

#+begin_src sml
signature MONAD = sig
  include FUNCTOR;
  val return : 'a -> 'a t;
  val bind : 'a t -> ('a -> 'b t) -> 'b t;
  val join : 'a t t -> 'a t;
end;
#+end_src

We may or may not need the ~exec~ function to /perform/ the computation abstracted
away by the monad.

