docs/comp-sci/sml/free-monad.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Free Monads - SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Free Monads - SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-d40ee261-e0d6-4991-9643-dd465129632e">1. Overview</a></li>
<li><a href="#h-77ec8efc-07fa-4faa-b0d3-52077da95d9a">2. Functors in SML</a></li>
<li><a href="#h-f82f46d4-0bb4-4502-bc6e-f429a310b41a">3. Derivation Using the Free Monoid</a></li>
<li><a href="#h-39916d46-ea6d-4955-bda1-2e7a30a9742c">4. Free Monads</a>
<ul>
<li><a href="#h-0744c31b-75ad-4322-a576-13930453262f">4.1. Monad signature</a></li>
<li><a href="#h-21c5ddfd-166b-4d71-a374-b0957f4c2c33">4.2. Free Monad Signature</a></li>
<li><a href="#h-2cf63700-06e7-4bb3-90d4-ad0e0c659760">4.3. Example: IO</a></li>
<li><a href="#h-30769603-579e-490f-9b5f-415be5f52488">4.4. Example usage of IO Free Monad</a></li>
</ul>
</li>
<li><a href="#h-08b0c8ac-8f74-470e-af25-5de34356a429">5. Concluding Remarks</a></li>
<li><a href="#h-0a2734cf-f3b6-433b-9422-343aac57d70f">6. References</a>
<ul>
<li><a href="#h-c1498249-8e2b-4bf5-9909-c1df4c7a08d5">6.1. Examples in OCaml</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-d40ee261-e0d6-4991-9643-dd465129632e" class="outline-2">
<h2 id="h-d40ee261-e0d6-4991-9643-dd465129632e"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-d40ee261-e0d6-4991-9643-dd465129632e">
<p>
The basic idea underlying free monads is to start with an endofunctor
\(f\) and then turn it into a monad, just as the free group starts with
a set then turns it into a group.
</p>

<p>
Free monads are useful when it comes into describing side-effects
monadically. 
</p>

<p>
Haskell takes this idea and runs with it.
</p>

<p>
We will see how this works in Standard ML.
</p>
</div>
</div>
<div id="outline-container-h-77ec8efc-07fa-4faa-b0d3-52077da95d9a" class="outline-2">
<h2 id="h-77ec8efc-07fa-4faa-b0d3-52077da95d9a"><span class="section-number-2">2.</span> Functors in SML</h2>
<div class="outline-text-2" id="text-h-77ec8efc-07fa-4faa-b0d3-52077da95d9a">
<p>
A <code>Functor</code> (not to be confused with the builtin <code>functor</code> keyword in
the module language) is a structure adhering to the following
signature:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">FUNCTOR</span> = <span class="org-keyword">sig</span>
  <span class="org-keyword">type</span> 'a <span class="org-type-def">t</span>;
  <span class="org-keyword">val</span> <span class="org-variable-name">map</span> : ('a -&gt; 'b) -&gt; 'a t -&gt; 'b t;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
That's all we need. There are two functor laws, which are inspired by
category theory. If <code>F</code> is a functor, then&#x2026;
</p>

<ul class="org-ul">
<li>unit law: <code>F.map id == id</code></li>
<li>preserves composition: <code>F.map (g o f) = (F.map g) o (F.map f)</code></li>
</ul>

<p>
Ta-duh!
</p>

<p>
(See also the <a href="functor.html">dedicated discussion</a> about functors on its own page.)
</p>
</div>
</div>
<div id="outline-container-h-f82f46d4-0bb4-4502-bc6e-f429a310b41a" class="outline-2">
<h2 id="h-f82f46d4-0bb4-4502-bc6e-f429a310b41a"><span class="section-number-2">3.</span> Derivation Using the Free Monoid</h2>
<div class="outline-text-2" id="text-h-f82f46d4-0bb4-4502-bc6e-f429a310b41a">
<p>
A monad is a monoid in the category of endofunctors, and a free monad
is just the free monoid in that category. We can leverage this
information to deduce the structure of the <code>join</code> function for a free
monad. 
</p>

<p>
The free monoid is precisely the list. (When the free monoid is
generated by a singleton, it's isomorphic to the natural numbers.) The
analogy with free monads should be:
</p>

<pre class="example" id="orga5d5688">
datatype 'a list =          nil | cons of 'a * 'a list;
(* structure F : FUNCTOR *)
datatype 'a Free = Return of 'a | Join of ('a Free) F.t;
</pre>

<p>
The intuition is that we have <code>Join</code> apply <code>F</code> iteratively. Zero
iterates would be the <code>Return</code> data constructor.
</p>

<p>
Free monoids have an <code>append</code> function (which, for lists, is&#x2026;the
append function). The analogous function for monads would be the
<code>join : 'a F.t F.t -&gt; 'a F.t</code>. Similarly, monoids have an <code>empty</code> constant,
which corresponds to the <code>return</code> function for monads in "programmer argot".
</p>

<p>
The free monoid of iterates of <code>F</code> would then correspond to a type of
the form
</p>
<pre class="example" id="org90a968a">
datatype 'a Free = Zero of 'a | Succ of 'a Free F.t;
</pre>
<p>
The empty "constant" would be <code>empty : 'a -&gt; 'a Free</code> and it's given
precisely by the <code>Zero</code> constructor.
</p>

<p>
The append operation would have its type signature be
<code>append : 'a Free Free -&gt; 'a Free</code>. This would send <code>append (Zero x) = x</code>
since <code>x : 'a Free</code>, and then the only question is how it would behave
on <code>Succ x</code>?
</p>

<p>
Well, if we considered <code>Succ x : 'a Free Free</code>, then <code>x : 'a Free Free F.t</code>.
We see that <code>F.map append : 'a Free Free F.t -&gt; 'a Free F.t</code>, and so
it's obvious applicable to <code>x</code>. However the resulting type is not <code>'a Free</code>.
But it is the correct type to be fed into the <code>Succ</code> data constructor.
This amounts to "flattening" the "leafs" of <code>x</code>. This suggests <code>append (Succ x) = Succ (F.map append x)</code>
is the correct definition.
</p>

<p>
This <code>append</code> function is the <code>join</code> function for the free monad:
</p>
<pre class="example" id="orgf7c20fa">
fun append (Zero x) = x
  | append (Succ x) = Succ (F.map append x);

val join = append;
</pre>

<p>
From the <code>join</code> function (and the functor gives us a <code>map</code> function),
we can infer the <code>bind</code> function immediately. 
</p>
</div>
</div>
<div id="outline-container-h-39916d46-ea6d-4955-bda1-2e7a30a9742c" class="outline-2">
<h2 id="h-39916d46-ea6d-4955-bda1-2e7a30a9742c"><span class="section-number-2">4.</span> Free Monads</h2>
<div class="outline-text-2" id="text-h-39916d46-ea6d-4955-bda1-2e7a30a9742c">
</div>
<div id="outline-container-h-0744c31b-75ad-4322-a576-13930453262f" class="outline-3">
<h3 id="h-0744c31b-75ad-4322-a576-13930453262f"><span class="section-number-3">4.1.</span> Monad signature</h3>
<div class="outline-text-3" id="text-h-0744c31b-75ad-4322-a576-13930453262f">
<p>
Just to review, we have the following signature for monads in Standard ML:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">MONAD</span> = <span class="org-keyword">sig</span>
  <span class="org-keyword">include</span> FUNCTOR;
  <span class="org-keyword">val</span> <span class="org-variable-name">return</span> : 'a -&gt; 'a t;
  <span class="org-keyword">val</span> <span class="org-variable-name">bind</span> : 'a t -&gt; ('a -&gt; 'b t) -&gt; 'b t;
  <span class="org-keyword">val</span> <span class="org-variable-name">join</span> : 'a t t -&gt; 'a t;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
We may or may not need the <code>exec</code> function to <i>perform</i> the computation abstracted
away by the monad.
</p>
</div>
</div>
