comp-sci/sml/free-monad.org
** Free Monad Signature
:PROPERTIES:
:CUSTOM_ID: h-21c5ddfd-166b-4d71-a374-b0957f4c2c33
:END:

A free monad will take a ~Functor~, and turn it into a monad. The
~Functor~ is kept as a field of the structure.

Intuitively, a free monad is generated by a "join" operation (or
"multiplication") operation. It suffices to describe this using a
datatype with ~Return of 'a~ and =Join of 'a t F.t=, so the operations
"stack" as we'd expect from a free gadget.

We then have the following signature:

#+begin_src sml
signature FREE_MONAD = sig
  structure F : FUNCTOR;
  (* probably should rename the constructors to the more
  intuitive RETURN of 'a | JOIN of ('a t) F.t
  since $\mu$ corresponds to the `join` function for a monad.
  This `JOIN` constructor wraps the "outer" functor as a
  placeholder. *)
  datatype 'a t = Return of 'a
                | Join of ('a t) F.t;
  val return : 'a -> 'a t;
  val bind : 'a t -> ('a -> 'b t) -> 'b t;
  val join : 'a t t -> 'a t;
  val map : ('a -> 'b) -> 'a t -> 'b t;
  val lift : 'a F.t -> 'a t;
  (* lift is analogous to (fn x => [x]) *)
  (* fun lift x = Join (F.fmap Return x); *)

  (* val fold : ('a F.t -> 'a) -> 'a m -> 'a; *)
(* fun fold _ (Return a) = a
     | fold f (Join x) = f (F.fmap (fold f) x);
*)
end;
#+end_src

Note that we need to "hack" the SML module system to make this a
functor. The type alias ~type 'a t = 'a m~ accomplishes this. See Bob
Harper's [[https://www.cs.cmu.edu/~rwh/isml/book.pdf][Programming in SML]], Section 18.1, for details. (We could have
written something like ~include MONAD; include FUNCTOR where type 'a
t = 'a m~ in the signature, but it would not change the implementation
as a structure or functor).

Here ~Return~ and ~Join~ are [data] constructors for the free monad
generated by the Functor ~F~.

The bind function (which tells us everything we'd want to know about
a monad) is the "default implementation" in terms of ~Join~ and ~F.map~
with some subtlety. Normally we would have ~x >>= f = join (F.map f x)~
but we need to "propagate" the ~(>>= f)~ down; i.e., we would have
~join (F.map (fn m => bind m f) x)~ be the bind function.

The ~bind~ implementation amounts to more of a ~map~ than anything else.
(In fact, we need to patch this up later on if we want to use
~Free(F)~ as a monad; we can redefine ~fun bind m f = join (map f m)~
at the end of the functor structure's body to avoid this.)

Another way to approach this is to first implement the ~map~ function,
then the ~join~ function, and then the ~bind~ function follows as the
default implementation as ~bind m f = join (map f m)~ (see, e.g., Bartosz
Milewski's [[https://github.com/hmemcpy/milewski-ctfp-pdf/releases/download/v1.3.0/category-theory-for-programmers.pdf][Category Theory for Programmers]], section 20.2).

Also observe we include the ~where type...~ clause to make
public the underlying functor's type:

#+begin_src sml
functor Free(F : FUNCTOR) :> FREE_MONAD
                               where type 'a F.t = 'a F.t
                                 = struct
  structure F = F;
  datatype 'a t = Return of 'a
                | Join of ('a t) F.t;
  (* return : 'a -> 'a t *)
  fun return x = Return x;

  fun map f (Return a) = Return (f a)
    | map f (Join x) = Join (F.map (map f) x);

  fun join (Return x) = x
    | join (Join x) = Join (F.map join x);

  fun bind m f = join (map f m);
  
  (* lift : 'a F.t -> 'a t *)
  fun lift f = Join (F.map return f);
end;
#+end_src

This is actually a bit more explicit than the Haskell type signatures,
since Haskell does not distinguish which instance each ~fmap~ comes from.

