docs/comp-sci/sml/free-monad.html
<div id="outline-container-h-21c5ddfd-166b-4d71-a374-b0957f4c2c33" class="outline-3">
<h3 id="h-21c5ddfd-166b-4d71-a374-b0957f4c2c33"><span class="section-number-3">4.2.</span> Free Monad Signature</h3>
<div class="outline-text-3" id="text-h-21c5ddfd-166b-4d71-a374-b0957f4c2c33">
<p>
A free monad will take a <code>Functor</code>, and turn it into a monad. The
<code>Functor</code> is kept as a field of the structure.
</p>

<p>
Intuitively, a free monad is generated by a "join" operation (or
"multiplication") operation. It suffices to describe this using a
datatype with <code>Return of 'a</code> and <code>Join of 'a t F.t</code>, so the operations
"stack" as we'd expect from a free gadget.
</p>

<p>
We then have the following signature:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">signature</span> <span class="org-interface-def">FREE_MONAD</span> = <span class="org-keyword">sig</span>
  <span class="org-keyword">structure</span> <span class="org-module-def">F</span> : FUNCTOR;
  <span class="org-comment-delimiter">(* </span><span class="org-comment">probably should rename the constructors to the more</span>
<span class="org-comment">  intuitive RETURN of 'a | JOIN of ('a t) F.t</span>
<span class="org-comment">  since $\mu$ corresponds to the `join` function for a monad.</span>
<span class="org-comment">  This `JOIN` constructor wraps the "outer" functor as a</span>
<span class="org-comment">  placeholder.</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">datatype</span> 'a <span class="org-type-def">t</span> = Return <span class="org-keyword">of</span> 'a
                | Join <span class="org-keyword">of</span> ('a t) F.t;
  <span class="org-keyword">val</span> <span class="org-variable-name">return</span> : 'a -&gt; 'a t;
  <span class="org-keyword">val</span> <span class="org-variable-name">bind</span> : 'a t -&gt; ('a -&gt; 'b t) -&gt; 'b t;
  <span class="org-keyword">val</span> <span class="org-variable-name">join</span> : 'a t t -&gt; 'a t;
  <span class="org-keyword">val</span> <span class="org-variable-name">map</span> : ('a -&gt; 'b) -&gt; 'a t -&gt; 'b t;
  <span class="org-keyword">val</span> <span class="org-variable-name">lift</span> : 'a F.t -&gt; 'a t;
  <span class="org-comment-delimiter">(* </span><span class="org-comment">lift is analogous to (fn x =&gt; [x])</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-comment-delimiter">(* </span><span class="org-comment">fun lift x = Join (F.fmap Return x);</span><span class="org-comment-delimiter"> *)</span>

  <span class="org-comment-delimiter">(* </span><span class="org-comment">val fold : ('a F.t -&gt; 'a) -&gt; 'a m -&gt; 'a;</span><span class="org-comment-delimiter"> *)</span>
<span class="org-comment-delimiter">(* </span><span class="org-comment">fun fold _ (Return a) = a</span>
<span class="org-comment">     | fold f (Join x) = f (F.fmap (fold f) x);</span>
<span class="org-comment-delimiter">*)</span>
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
Note that we need to "hack" the SML module system to make this a
functor. The type alias <code>type 'a t = 'a m</code> accomplishes this. See Bob
Harper's <a href="https://www.cs.cmu.edu/~rwh/isml/book.pdf">Programming in SML</a>, Section 18.1, for details. (We could have
written something like <code>include MONAD; include FUNCTOR where type 'a
t = 'a m</code> in the signature, but it would not change the implementation
as a structure or functor).
</p>

<p>
Here <code>Return</code> and <code>Join</code> are [data] constructors for the free monad
generated by the Functor <code>F</code>.
</p>

<p>
The bind function (which tells us everything we'd want to know about
a monad) is the "default implementation" in terms of <code>Join</code> and <code>F.map</code>
with some subtlety. Normally we would have <code>x &gt;&gt;= f = join (F.map f x)</code>
but we need to "propagate" the <code>(&gt;&gt;= f)</code> down; i.e., we would have
<code>join (F.map (fn m =&gt; bind m f) x)</code> be the bind function.
</p>

<p>
The <code>bind</code> implementation amounts to more of a <code>map</code> than anything else.
(In fact, we need to patch this up later on if we want to use
<code>Free(F)</code> as a monad; we can redefine <code>fun bind m f = join (map f m)</code>
at the end of the functor structure's body to avoid this.)
</p>

<p>
Another way to approach this is to first implement the <code>map</code> function,
then the <code>join</code> function, and then the <code>bind</code> function follows as the
default implementation as <code>bind m f = join (map f m)</code> (see, e.g., Bartosz
Milewski's <a href="https://github.com/hmemcpy/milewski-ctfp-pdf/releases/download/v1.3.0/category-theory-for-programmers.pdf">Category Theory for Programmers</a>, section 20.2).
</p>

<p>
Also observe we include the <code>where type...</code> clause to make
public the underlying functor's type:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">functor</span> <span class="org-module-def">Free</span>(F : FUNCTOR) :&gt; FREE_MONAD
                               <span class="org-keyword">where</span> <span class="org-keyword">type</span> 'a <span class="org-type-def">F.t</span> = 'a F.t
                                 = <span class="org-keyword">struct</span>
  <span class="org-keyword">structure</span> <span class="org-module-def">F</span> = F;
  <span class="org-keyword">datatype</span> 'a <span class="org-type-def">t</span> = Return <span class="org-keyword">of</span> 'a
                | Join <span class="org-keyword">of</span> ('a t) F.t;
  <span class="org-comment-delimiter">(* </span><span class="org-comment">return : 'a -&gt; 'a t</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">fun</span> <span class="org-function-name">return</span> x = Return x;

  <span class="org-keyword">fun</span> <span class="org-function-name">map</span> f (Return a) = Return (f a)
    | map f (Join x) = Join (F.map (map f) x);

  <span class="org-keyword">fun</span> <span class="org-function-name">join</span> (Return x) = x
    | join (Join x) = Join (F.map join x);

  <span class="org-keyword">fun</span> <span class="org-function-name">bind</span> m f = join (map f m);
  
  <span class="org-comment-delimiter">(* </span><span class="org-comment">lift : 'a F.t -&gt; 'a t</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">fun</span> <span class="org-function-name">lift</span> f = Join (F.map return f);
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
This is actually a bit more explicit than the Haskell type signatures,
since Haskell does not distinguish which instance each <code>fmap</code> comes from.
</p>
</div>
</div>
