comp-sci/sml/free-monad.org
** Example: IO
:PROPERTIES:
:CUSTOM_ID: h-2cf63700-06e7-4bb3-90d4-ad0e0c659760
:END:

We can use the free monad to describe a simple IO monad. Where to
start?

First we need to construct a functor with the various operations we'd
like to perform. For now, simply printing a string to the screen and
reading a string from ~stdIn~ suffices.

We encode this as a datatype
by making each operation with a signature like
~Foo : A -> B -> C -> Z IO.t~
corresponds to a data constructor
=FooOp of A * B * C * (Z -> 'a)=.
This is the idiom for using free monads in functional programming: we
have a functor describing the syntax tree for an embedded DSL, and we
translate the type signature for each operation in the DSL into a type
for the data constructor's payload as we have just sketched.

One caveat: if ~Z = unit~ (as would happen with =print_line=), then we
can replace =Z -> 'a= with just ~'a~. 

#+begin_danger
There is some difficulty with IORef operations. The operations would
be:
- =newIORef : 'a -> ('a IORef) IO.t=
- =readIORef : 'a IORef -> 'a IO.t=
- =writeIORef : 'a IORef -> 'a -> unit IO.t=

The type variable ='a= appearing in these operations are not
quantified, and that causes problems. This requires working with
multiple bound type variables ~datatype ('a,'b) t = ...~, which then
will not match the expected signature for a functor.
#+end_danger

#+begin_src sml
(* A functor describing the operations with side-effects in IO

In general, an operation `Foo : A -> B -> C -> Z IO.t` would
be encoded by a data constructor `FooOp of A * B * C * (Z -> 'a)`.

We also treat `unit -> 'a` as interchangeable with `'a`.
 *)
structure IO_Op = struct
  datatype 'a t = Print of (string * 'a)
                | Read of (string -> 'a);
  fun map f (Print (s,k)) = Print (s, f k)
    | map f (Read k) = Read (fn s => f (k s));
end;
#+end_src

We will also have a ~read_line~ function which we need to implement
(it's straightforward):

#+begin_src sml
fun read_line () =
  case TextIO.inputLine TextIO.stdIn of
      SOME s => s
    | NONE => "";
#+end_src

Now we can put all these pieces together to form the free monad
describing IO side effects we prescribed:

#+begin_src sml
local
  structure FreeIO = Free(IO_Op);
in
  structure Job : sig
      datatype t = datatype FreeIO.t
      val bind: 'a t -> ('a -> 'b t) -> 'b t
      val join: 'a t t -> 'a t
      val map: ('a -> 'b) -> 'a t -> 'b t
      val return: 'a -> 'a t
      val unsafePerform: 'a t -> 'a
  end = struct
    open FreeIO;
    (* datatype replication to make the constructors public *)
    datatype t = datatype FreeIO.t;
    (* execute the monad *)
    fun unsafePerform (Return x) = x
      | unsafePerform (Join f) =
        case f of
            (IO_Op.Print (s, k)) => (print s;
                                     unsafePerform k)
          | (IO_Op.Read k) => unsafePerform (k (read_line()));
  end
end;
#+end_src

** Example usage of IO Free Monad
:PROPERTIES:
:CUSTOM_ID: h-30769603-579e-490f-9b5f-415be5f52488
:END:

We can now use the previous machinations in a toy example:

#+begin_src sml
infix >> >>=
fun ((m : 'a Job.t) >>= (n : 'a -> 'b Job.t)) = Job.bind m n;
fun (m >> n) = Job.bind m (fn _ => n);

fun print_string msg =
  Job.Join (IO_Op.Print (msg, Job.Return ()));
val read_string =
  Job.Join (IO_Op.Read (fn msg => Job.Return msg));
fun main () =
  (print_string "What's your name? ") >>
    (read_string >>= (fn name => 
                       (print_string "Hello, ") >>
                         (print_string name)));

Job.unsafePerform (main ());
#+end_src

This isn't terribly different than the IO Monad implemented in
Standard ML as found in Andrew Gordon's PhD dissertation.

* Concluding Remarks
:PROPERTIES:
:CUSTOM_ID: h-08b0c8ac-8f74-470e-af25-5de34356a429
:END:

The Free monad is used to decompose an embedded DSL, but in Haskell it
comes at the cost of losing a lot of compiler optimizations. So
instead it's preferable to use the MTL monad transformer library.

The other use for Free monads is to containerize side-effects (or
other effects).

It appears to be used implicitly in:

- Matthew Fluet,\\
  "A Monadic Account of First-class Synchronous Events".\\
  Manuscript dated 20 January 2006, [[https://www.cs.cornell.edu/people/fluet/research/tx-events/CS257/cs257.pdf][PDF]]

* References
:PROPERTIES:
:CUSTOM_ID: h-0a2734cf-f3b6-433b-9422-343aac57d70f
:END:

- [[https://okmij.org/ftp/Computation/free-monad.html][Free and Freer Monads: Putting Monads Back into Closet]]
- [[https://www.haskellforall.com/2012/06/you-could-have-invented-free-monads.html][Why Free Monads Matter]]
- [[https://underscore.io/blog/posts/2015/04/23/deriving-the-free-monad.html][Deriving the Free Monad]]
- [[http://rgrinberg.com/posts/free-monads-in-the-wild-ocaml/][Free Monads in the Wild - OCaml Edition]]
- [[https://www.parsonsmatt.org/2017/09/22/what_does_free_buy_us.html][What does Free buy us?]]
- Jeremy Mikkola's [[https://jeremymikkola.com/posts/2017_07_11_free_monad_cheatsheet.html][Cheatsheet: Free Monad]]
- [[https://joa.sh/posts/2016-07-29-free-monad-steps.html][Free monad in 7 steps]]
  
Some subtleties around the sensationalist hype about Free Monads:
- [[https://markkarpov.com/post/free-monad-considered-harmful][Free monad considered harmful]]
- [[https://www.atamo.com/articles/free-monads-wont-detox-your-colon/][Free monads won't detox your colon]]

** Examples in OCaml
:PROPERTIES:
:CUSTOM_ID: h-c1498249-8e2b-4bf5-9909-c1df4c7a08d5
:END:

- Nick Vanderweit's [[https://gist.github.com/nvanderw/8995984][Free monads in OCaml]] 