docs/comp-sci/sml/free-monad.html
<div id="outline-container-h-2cf63700-06e7-4bb3-90d4-ad0e0c659760" class="outline-3">
<h3 id="h-2cf63700-06e7-4bb3-90d4-ad0e0c659760"><span class="section-number-3">4.3.</span> Example: IO</h3>
<div class="outline-text-3" id="text-h-2cf63700-06e7-4bb3-90d4-ad0e0c659760">
<p>
We can use the free monad to describe a simple IO monad. Where to
start?
</p>

<p>
First we need to construct a functor with the various operations we'd
like to perform. For now, simply printing a string to the screen and
reading a string from <code>stdIn</code> suffices.
</p>

<p>
We encode this as a datatype
by making each operation with a signature like
<code>Foo : A -&gt; B -&gt; C -&gt; Z IO.t</code>
corresponds to a data constructor
<code>FooOp of A * B * C * (Z -&gt; 'a)</code>.
This is the idiom for using free monads in functional programming: we
have a functor describing the syntax tree for an embedded DSL, and we
translate the type signature for each operation in the DSL into a type
for the data constructor's payload as we have just sketched.
</p>

<p>
One caveat: if <code>Z = unit</code> (as would happen with <code>print_line</code>), then we
can replace <code>Z -&gt; 'a</code> with just <code>'a</code>. 
</p>

<div class="danger" id="orgcb6c0e6">
<p>
There is some difficulty with IORef operations. The operations would
be:
</p>
<ul class="org-ul">
<li><code>newIORef : 'a -&gt; ('a IORef) IO.t</code></li>
<li><code>readIORef : 'a IORef -&gt; 'a IO.t</code></li>
<li><code>writeIORef : 'a IORef -&gt; 'a -&gt; unit IO.t</code></li>
</ul>

<p>
The type variable <code>'a</code> appearing in these operations are not
quantified, and that causes problems. This requires working with
multiple bound type variables <code>datatype ('a,'b) t = ...</code>, which then
will not match the expected signature for a functor.
</p>

</div>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-comment-delimiter">(* </span><span class="org-comment">A functor describing the operations with side-effects in IO</span>

<span class="org-comment">In general, an operation `Foo : A -&gt; B -&gt; C -&gt; Z IO.t` would</span>
<span class="org-comment">be encoded by a data constructor `FooOp of A * B * C * (Z -&gt; '</span><span class="org-comment"><span class="org-highlight-beyond-fill-column">a)`.</span></span>

<span class="org-comment">We also treat `unit -&gt; 'a` as interchangeable with `'a`.</span>
<span class="org-comment-delimiter"> *)</span>
<span class="org-keyword">structure</span> <span class="org-module-def">IO_Op</span> = <span class="org-keyword">struct</span>
  <span class="org-keyword">datatype</span> 'a <span class="org-type-def">t</span> = Print <span class="org-keyword">of</span> (string * 'a)
                | Read <span class="org-keyword">of</span> (string -&gt; 'a);
  <span class="org-keyword">fun</span> <span class="org-function-name">map</span> f (Print (s,k)) = Print (s, f k)
    | map f (Read k) = Read (<span class="org-keyword">fn</span> s =&gt; f (k s));
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
We will also have a <code>read_line</code> function which we need to implement
(it's straightforward):
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">read_line</span> () =
  <span class="org-keyword">case</span> TextIO.inputLine TextIO.stdIn <span class="org-keyword">of</span>
      SOME s =&gt; s
    | NONE =&gt; <span class="org-string">""</span>;
</pre>
</div>

<p>
Now we can put all these pieces together to form the free monad
describing IO side effects we prescribed:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">local</span>
  <span class="org-keyword">structure</span> <span class="org-module-def">FreeIO</span> = Free(IO_Op);
<span class="org-keyword">in</span>
  <span class="org-keyword">structure</span> <span class="org-module-def">Job</span> : <span class="org-keyword">sig</span>
      <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = <span class="org-keyword">datatype</span> <span class="org-type-def">FreeIO.t</span>
      <span class="org-keyword">val</span> <span class="org-variable-name">bind</span>: 'a t -&gt; ('a -&gt; 'b t) -&gt; 'b t
      <span class="org-keyword">val</span> <span class="org-variable-name">join</span>: 'a t t -&gt; 'a t
      <span class="org-keyword">val</span> <span class="org-variable-name">map</span>: ('a -&gt; 'b) -&gt; 'a t -&gt; 'b t
      <span class="org-keyword">val</span> <span class="org-variable-name">return</span>: 'a -&gt; 'a t
      <span class="org-keyword">val</span> <span class="org-variable-name">unsafePerform</span>: 'a t -&gt; 'a
  <span class="org-keyword">end</span> = <span class="org-keyword">struct</span>
    <span class="org-keyword">open</span> FreeIO;
    <span class="org-comment-delimiter">(* </span><span class="org-comment">datatype replication to make the constructors public</span><span class="org-comment-delimiter"> *)</span>
    <span class="org-keyword">datatype</span> <span class="org-type-def">t</span> = <span class="org-keyword">datatype</span> <span class="org-type-def">FreeIO.t</span>;
    <span class="org-comment-delimiter">(* </span><span class="org-comment">execute the monad</span><span class="org-comment-delimiter"> *)</span>
    <span class="org-keyword">fun</span> <span class="org-function-name">unsafePerform</span> (Return x) = x
      | unsafePerform (Join f) =
        <span class="org-keyword">case</span> f <span class="org-keyword">of</span>
            (IO_Op.Print (s, k)) =&gt; (print s;
                                     unsafePerform k)
          | (IO_Op.Read k) =&gt; unsafePerform (k (read_line()));
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-h-30769603-579e-490f-9b5f-415be5f52488" class="outline-3">
<h3 id="h-30769603-579e-490f-9b5f-415be5f52488"><span class="section-number-3">4.4.</span> Example usage of IO Free Monad</h3>
<div class="outline-text-3" id="text-h-30769603-579e-490f-9b5f-415be5f52488">
<p>
We can now use the previous machinations in a toy example:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">infix</span> &gt;&gt; &gt;&gt;=
<span class="org-keyword">fun</span> ((m : 'a Job.t) &gt;&gt;= (n : 'a -&gt; 'b Job.t)) = Job.bind m n;
<span class="org-keyword">fun</span> (m &gt;&gt; n) = Job.bind m (<span class="org-keyword">fn</span> _ =&gt; n);

<span class="org-keyword">fun</span> <span class="org-function-name">print_string</span> msg =
  Job.Join (IO_Op.Print (msg, Job.Return ()));
<span class="org-keyword">val</span> <span class="org-variable-name">read_string</span> =
  Job.Join (IO_Op.Read (<span class="org-keyword">fn</span> msg =&gt; Job.Return msg));
<span class="org-keyword">fun</span> <span class="org-function-name">main</span> () =
  (print_string <span class="org-string">"What's your name? "</span>) &gt;&gt;
    (read_string &gt;&gt;= (<span class="org-keyword">fn</span> name =&gt; 
                       (print_string <span class="org-string">"Hello, "</span>) &gt;&gt;
                         (print_string name)));

Job.unsafePerform (main ());
</pre>
</div>

<p>
This isn't terribly different than the IO Monad implemented in
Standard ML as found in Andrew Gordon's PhD dissertation.
</p>
</div>
</div>
</div>
<div id="outline-container-h-08b0c8ac-8f74-470e-af25-5de34356a429" class="outline-2">
<h2 id="h-08b0c8ac-8f74-470e-af25-5de34356a429"><span class="section-number-2">5.</span> Concluding Remarks</h2>
<div class="outline-text-2" id="text-h-08b0c8ac-8f74-470e-af25-5de34356a429">
<p>
The Free monad is used to decompose an embedded DSL, but in Haskell it
comes at the cost of losing a lot of compiler optimizations. So
instead it's preferable to use the MTL monad transformer library.
</p>

<p>
The other use for Free monads is to containerize side-effects (or
other effects).
</p>

<p>
It appears to be used implicitly in:
</p>

<ul class="org-ul">
<li>Matthew Fluet,<br>
"A Monadic Account of First-class Synchronous Events".<br>
Manuscript dated 20 January 2006, <a href="https://www.cs.cornell.edu/people/fluet/research/tx-events/CS257/cs257.pdf">PDF</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-0a2734cf-f3b6-433b-9422-343aac57d70f" class="outline-2">
<h2 id="h-0a2734cf-f3b6-433b-9422-343aac57d70f"><span class="section-number-2">6.</span> References</h2>
<div class="outline-text-2" id="text-h-0a2734cf-f3b6-433b-9422-343aac57d70f">
<ul class="org-ul">
<li><a href="https://okmij.org/ftp/Computation/free-monad.html">Free and Freer Monads: Putting Monads Back into Closet</a></li>
<li><a href="https://www.haskellforall.com/2012/06/you-could-have-invented-free-monads.html">Why Free Monads Matter</a></li>
<li><a href="https://underscore.io/blog/posts/2015/04/23/deriving-the-free-monad.html">Deriving the Free Monad</a></li>
<li><a href="http://rgrinberg.com/posts/free-monads-in-the-wild-ocaml/">Free Monads in the Wild - OCaml Edition</a></li>
<li><a href="https://www.parsonsmatt.org/2017/09/22/what_does_free_buy_us.html">What does Free buy us?</a></li>
<li>Jeremy Mikkola's <a href="https://jeremymikkola.com/posts/2017_07_11_free_monad_cheatsheet.html">Cheatsheet: Free Monad</a></li>
<li><a href="https://joa.sh/posts/2016-07-29-free-monad-steps.html">Free monad in 7 steps</a></li>
</ul>

<p>
Some subtleties around the sensationalist hype about Free Monads:
</p>
<ul class="org-ul">
<li><a href="https://markkarpov.com/post/free-monad-considered-harmful">Free monad considered harmful</a></li>
<li><a href="https://www.atamo.com/articles/free-monads-wont-detox-your-colon/">Free monads won't detox your colon</a></li>
</ul>
</div>
<div id="outline-container-h-c1498249-8e2b-4bf5-9909-c1df4c7a08d5" class="outline-3">
<h3 id="h-c1498249-8e2b-4bf5-9909-c1df4c7a08d5"><span class="section-number-3">6.1.</span> Examples in OCaml</h3>
<div class="outline-text-3" id="text-h-c1498249-8e2b-4bf5-9909-c1df4c7a08d5">
<ul class="org-ul">
<li>Nick Vanderweit's <a href="https://gist.github.com/nvanderw/8995984">Free monads in OCaml</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sun, 11 May 2025 09:14:21 -0700
</div>
</body>
</html>
